perf/cases/quote/quote-no-cache.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api.quote-no-cache"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp [1]
      duration: 30
      arrivalRate: 5
      rampTo: 50
    - name: Plain [1]
      duration: 60
      arrivalRate: 50
    - name: Ramp [2]
      duration: 30
      arrivalRate: 50
      rampTo: 100
    - name: Plain [2]
      duration: 60
      arrivalRate: 100
    - name: Spike [1]
      duration: 25
      arrivalRate: 200
    - name: Plain [3]
      duration: 60
      arrivalRate: 150
    - name: Ramp [Shutdown]
      duration: 30
      arrivalRate: 150
      rampTo: 0
    

scenarios:
  - name: Quotes [No Cache]
    flow:
      - get:
          url: "/quotes"